Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 453
			Высота: 151
			Заголовок: " "
			Param24: 6
			Param25: 25
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Табличная часть: 
	{
		Param2: 1
		Multicolumn: 
		{
			browse: 
			{
				ДопФлаги: Flag20, Flag21, Flag23, Flag28, Flag30
				X: 6
				Y: 17
				Ширина: 441
				Высота: 128
				ПорядокОбхода: 4151
				Слой: Основной
			}
		}
		Колонки: 
		{
			STATIC: Пиктограмма
			{
				Заголовок: " "
				ИдентификаторМетаданных: -2567
				ТипКолонки: 3
				Ширина: 20
				ПорядокОбхода: 4152
				Param15: 2
				Param22: 0
			}
			STATIC: ДатаОперации
			{
				Заголовок: "Дата"
				ИдентификаторМетаданных: -2669
				ТипКолонки: 2
				Ширина: 52
				ПорядокОбхода: 4153
				Param15: 2
				ОснФлаги: Недоступно, ЗапретитьРедактирование
				Param22: 0
			}
			STATIC: ВидДок
			{
				Заголовок: "Документ"
				ИдентификаторМетаданных: -2574
				ТипКолонки: 2
				Ширина: 72
				ПорядокОбхода: 4154
				Param15: 2
				Param22: 0
			}
			STATIC: НомерДок
			{
				Заголовок: "Номер"
				ИдентификаторМетаданных: -2570
				ТипКолонки: 2
				Ширина: 61
				ПорядокОбхода: 4155
				Param15: 2
				ОснФлаги: Недоступно, СНовойСтроки, ЗапретитьРедактирование
				Param22: 0
			}
			STATIC: НомерПроводки
			{
				Заголовок: "№"
				ИдентификаторМетаданных: -3159
				ТипКолонки: 2
				Ширина: 30
				ПорядокОбхода: 4156
				Param15: 2
				ОснФлаги: Недоступно, ВТойЖеКолонке, ЗапретитьРедактирование
				Param22: 0
			}
			STATIC: СчетДт
			{
				Заголовок: "Дт"
				ИдентификаторМетаданных: -2685
				ТипКолонки: 2
				Ширина: 38
				ПорядокОбхода: 4157
				Param15: 2
				ОснФлаги: Недоступно, ЗапретитьРедактирование
				Param22: 0
			}
			1CEDIT: СубконтоДт
			{
				Заголовок: "Субконто Дт"
				ИдентификаторМетаданных: -2683
				ТипКолонки: 2
				Ширина: 87
				ПорядокОбхода: 4158
				Param15: 2
				ОснФлаги: АвтоВыбор
				Param22: 0
			}
			STATIC: СчетКт
			{
				Заголовок: "Кт"
				ИдентификаторМетаданных: -2686
				ТипКолонки: 2
				Ширина: 39
				ПорядокОбхода: 4159
				Param15: 2
				ОснФлаги: Недоступно, ЗапретитьРедактирование
				Param22: 0
			}
			1CEDIT: СубконтоКт
			{
				Заголовок: "Субконто Кт"
				ИдентификаторМетаданных: -2684
				ТипКолонки: 2
				Ширина: 88
				ПорядокОбхода: 4160
				Param15: 2
				ОснФлаги: АвтоВыбор
				Param22: 0
			}
			STATIC: Количество
			{
				Заголовок: "Кол-во"
				ИдентификаторМетаданных: -2689
				ТипКолонки: 2
				Ширина: 60
				ПорядокОбхода: 4161
				Param15: 2
				ОснФлаги: Недоступно, ЗапретитьРедактирование
				Param22: 0
			}
			STATIC: Сумма
			{
				Заголовок: "Сумма"
				ИдентификаторМетаданных: -2690
				ТипКолонки: 2
				Ширина: 64
				ПорядокОбхода: 4162
				Param15: 2
				ОснФлаги: Недоступно, ВТойЖеКолонке, ЗапретитьРедактирование
				Param22: 0
			}
			1CEDIT: СодержаниеПроводки
			{
				Заголовок: "Содержание проводки"
				ИдентификаторМетаданных: Бухгалтерия.Проводка.СодержаниеПроводки
				Тип: Строка
				Длина: 100
				ТипКолонки: 1
				Ширина: 185
				ПорядокОбхода: 4163
				Param15: 2
				ОснФлаги: СНовойСтроки
				Param22: 0
			}
		}
	}
}
