// IDialogDoc.cpp: implementation of the CIDialogDoc class.
#include "stdafx.h"
#include "configsvcimpl.h"
#include "IDialogDoc.h"
#include "HackVirtual.h"
#include "ICfgDocuments.h"
#include "IConfig.h"
#include "IType1C.h"

ITypeInfo* CIDialogDoc::m_pTypeInfo=NULL;

static CTrapVirtual trapModified;
static CTrapSwap trapCrStatic;
static CTrapSwap trapCrPerm;
static CTrapSwap trapDefFixed;
static CTrapSwap trapDefNew;
static CTrapSwap trapCrInd;

class CEditDocWrap:public CEditDoc
{
public:
	int InitFA(CArchive& ar)
	{
		return InitFromArchive(ar);
	}
	void SetModifiedFlagW(BOOL bModif)
	{
		(this->*(void (CEditDocWrap::*)(BOOL))trapModified.m_pRealAdress)(bModif);
		if(bModif && GetFirstViewPosition())
			CIConfigEvents::m_ConfigEvents.FireDialogChange(this);
	}
	int  CreateIndirectW(CString &str)
	{
		trapCrInd.Swap();
		int ret=CreateIndirect(str);
		trapCrInd.Swap();
		return ret;
	}
	CCtrlHolder* CreatePermanentControlW(CRect const &rc, CType const &type,char const *str1,char const *str2,long lPar1,int iPar1,int iPar2, int iPar3)
	{
		trapCrPerm.Swap();
		CCtrlHolder* pRet=(this->*(CCtrlHolder*(CEditDocWrap::*)
			(CRect const &,CType const &,char const *,char const *,long,int,int,int))trapCrPerm.m_pFuncTrapped.pClassFunc)
			(rc,type,str1,str2,lPar1,iPar1,iPar2,iPar3);
		trapCrPerm.Swap();
		return pRet;
	}
	CCtrlHolder* CreateStaticTitleW(char const * str1,CRect const &rc)
	{
		trapCrStatic.Swap();
		CCtrlHolder* pRet=(this->*(CCtrlHolder*(CEditDocWrap::*)(char const *,CRect const&))trapCrStatic.m_pFuncTrapped.pClassFunc)(str1,rc);
		trapCrStatic.Swap();
		return pRet;
	}
	void DefineFixedControlW(CType const &type, char const * str1, char const *str2, long lPar, int iPar)
	{
		trapDefFixed.Swap();
		(this->*(void (CEditDocWrap::*)(CType const &, char const * , char const *, long , int ))
			trapDefFixed.m_pFuncTrapped.pClassFunc)
			(type, str1, str2, lPar, iPar);
		trapDefFixed.Swap();
	}
	void DefineNewControlW(CType const &type,char const *str1,char const *str2,long lPar, int iPar1, int iPar2, int iPar3)
	{
		trapDefNew.Swap();
		(this->*(void (CEditDocWrap::*)(CType const &,char const *,char const *,long , int , int , int ))
			trapDefNew.m_pFuncTrapped.pClassFunc)
			(type,str1,str2,lPar, iPar1, iPar2, iPar3);
		trapDefNew.Swap();
	}
};

CIDialogDoc::~CIDialogDoc()
{
}

void CIDialogDoc::Init()
{
	CObject* pObj=CICfgDocuments::m_pUsefulRTC[2]->CreateObject();
	trapModified.SetTrap(pObj,0x64/4,(AFX_PMSG)&CEditDocWrap::SetModifiedFlagW);
	delete pObj;
	/*
	trapCrStatic.SetTrap("editr.dll","?CreateStaticTitle@CEditDoc@@IAEPAVCCtrlHolder@@PBDABVCRect@@@Z",(AFX_PMSG)&CEditDocWrap::CreateStaticTitleW);
	trapDefFixed.SetTrap("editr.dll","?DefineFixedControl@CEditDoc@@AAEXABVCType@@PBD1JH@Z",(AFX_PMSG)&CEditDocWrap::DefineFixedControlW);
	trapCrPerm.SetTrap("editr.dll","?CreatePermanentControl@CEditDoc@@AAEPAVCCtrlHolder@@ABVCRect@@ABVCType@@PBD2JHHH@Z",(AFX_PMSG)&CEditDocWrap::CreatePermanentControlW);
	trapDefNew.SetTrap("editr.dll","?DefineNewControl@CEditDoc@@AAEXABVCType@@PBD1JHHH@Z",(AFX_PMSG)&CEditDocWrap::DefineNewControlW);
	trapCrInd.SetTrap("editr.dll","?CreateIndirect@CEditDoc@@QAEHAAVCString@@@Z",(AFX_PMSG)&CEditDocWrap::CreateIndirectW);
	*/
}


class CFakeParam
{
public:
	virtual void f1();
	virtual void f2();
	virtual int GetCtrlType();
	virtual void f3(CString& t);
};

class CCtrlHolder :public CObject		// Размер класса определен точно
{
public:
	//virtual hz()=0;		//0 - pVtable
	CRect m_rect;		//1-4
	DWORD m_param1;		//5
	CType m_type;
	CString m_formul;	//9
	CString m_strID;	//10
	CString m_title;	//11
	DWORD m_idForm;		//12
	DWORD m_mainFlags;	//13
	DWORD m_param2;		//14
	CString m_strDop;	//15
	CString m_tooltip;	//16
	CString m_strHelp;	//17
	LOGFONT m_font;		//18-32
	DWORD m_param3;		//33
	DWORD m_fontColor;		//34
	CPictureHolder7 m_picture;	//35
	DWORD m_param4;	//39
	DWORD m_pictID;	//40
	DWORD m_dopFlags;	//41
	DWORD m_param6;	//42
	DWORD m_hotKey;	//43	(LOWORD=vk code, HIWORD=modif (0x3 & 4-Shift, 8 - Ctrl, 16 - Alt)
	CString	m_layer;	//44
	DWORD m_param8;	//45
	DWORD m_param9;	//46
	DWORD m_param10;	//47
	CFakeParam* m_ctrlType;	//48 192

	virtual void f14()=0;
	virtual void f18()=0;
	virtual void f1C()=0;
	virtual void f20()=0;
	virtual void f24()=0;
	virtual void f28()=0;
	virtual void f2C()=0;
	virtual void f30()=0;
	virtual void f34()=0;
	virtual void f38()=0;
	virtual void f3C()=0;
	virtual void f40()=0;
	virtual void f44()=0;
	virtual LPCTSTR GetTitle()=0;
	virtual void f4C()=0;
	virtual void f50()=0;
	virtual void f54()=0;
	virtual void f58()=0;
	virtual void f5C()=0;
	virtual LPCTSTR GetIDName()=0;
	virtual LPCTSTR GetFormul()=0;
	virtual void f68()=0;
	virtual void f6C()=0;
	virtual void f70()=0;
	virtual void f74()=0;
	virtual void f78()=0;
};

class CBrowseHolder:public CCtrlHolder
{
public:
	CObject	m_obj1;			// 196 C4
	DWORD	m_obj1buf[4];
	CPtrArray m_ptrArr;
	DWORD m_buf[4];
};

enum ctrlTypes{
	ctText		=1,
	ctField		=2,
	ctButton	=3,
	ctFrame		=4,
	ctColumn	=5,
	ctMultiColumn=7,
	ctRefTree	=8,
