Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 233
			Высота: 295
			Заголовок: " Запуск юнит-тестов"
			Флаги: ЦветАвто, РастянутьКартинку, FormFlag24
			Param24: 6
			Param25: 25
			Флаги2: ЦветАвто, РастянутьКартинку, FormFlag24
			Слои
			{
				Основной: Видимый, Активный
			}
			ПанельИнструментов: Нет
		}
	}
	Элементы: 
	{
		BUTTON: 
		{
			Заголовок: "Закрыть"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 136
			Y: 271
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4152
			Формула: "#Закрыть"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Выполнить тестирование"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 17
			Y: 271
			Ширина: 106
			Высота: 14
			ПорядокОбхода: 4153
			Формула: "ЗагрузитьТесты()"
			Слой: Основной
		}
		STATIC: СтатуснаяСтрока
		{
			ДопФлаги: Flag28, Flag30
			X: 19
			Y: 250
			Ширина: 195
			Высота: 13
			ПорядокОбхода: 4154
			ОснФлаги: ШрифтПоУмолчанию
			ЦветТекста: 128
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "O"
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 173
			Y: 235
			Ширина: 10
			Высота: 12
			ПорядокОбхода: 4155
			Формула: "ПоказатьЛогФайл()"
			Слой: Основной
		}
		STATIC: 
		{
			Заголовок: "Лог-файл - КаталогИБ\\Testing\\1cpp_tests.log"
			ДопФлаги: Flag28, Flag30
			X: 18
			Y: 236
			Ширина: 155
			Высота: 13
			ПорядокОбхода: 4156
			Шрифт: MS Sans Serif
			{
				Param9: 204
				Param10: 1
				Param11: 2
				Param12: 1
				Param13: 34
			}
			ЦветТекста: 8388608
			Слой: Основной
		}
		CHECKBOX: фОптимизация
		{
			Заголовок: "Оптимизация"
			ИдентификаторМетаданных: -1
			Тип: Число
			Длина: 1
			ДопФлаги: Flag0, Flag1, Flag28, Flag30
			X: 142
			Y: 219
			Ширина: 62
			Высота: 13
			ПорядокОбхода: 4157
			Слой: Основной
		}
		CHECKBOX: фОтключитьПропускТестов
		{
			Заголовок: "Исполнять пропущенные тесты"
			Тип: Число
			Длина: 1
			ДопФлаги: Flag0, Flag1, Flag28, Flag30
			X: 18
			Y: 219
			Ширина: 122
			Высота: 13
			ПорядокОбхода: 4158
			Слой: Основной
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 208
			Y: 78
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4159
			Формула: "УстановитьТипы(""Инверсия"")"
			ОснФлаги: РастянутьКартинку
			ShortHint: "Инвертировать пометки"
			Пиктограмма: 0x1f000003
			Слой: Основной
		}
		BUTTON: Инверсия2
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 208
			Y: 59
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4160
			Формула: "УстановитьТипы(""Сброс"")"
			ОснФлаги: ИспользоватьОписание, КартинкаПоЦентру
			Hint: "Снять все пометки"
			Пиктограмма: 0x1f000002
			Слой: Основной
		}
		BUTTON: ВыделитьВсе2
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 208
			Y: 42
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4161
			Формула: "УстановитьТипы(""Все"")"
			ОснФлаги: ИспользоватьОписание, РастянутьКартинку
			Hint: "Пометить все"
			Пиктограмма: 0x1f000001
			Слой: Основной
		}
		LISTBOX: СписокКлассовЮнитТестов
		{
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 18
			Y: 42
			Ширина: 184
			Высота: 173
			ПорядокОбхода: 4162
			ОснФлаги: НеСохранять, СПометками
			Слой: Основной
		}
		STATIC: 
		{
			Заголовок: "Выберите набор тестируемых разделов 1С++"
			ДопФлаги: Flag28, Flag30
			X: 17
			Y: 17
			Ширина: 145
			Высота: 23
			ПорядокОбхода: 4163
			Шрифт: MS Sans Serif
			{
				Размер: 10
				Жирный: Да
				Param9: 204
				Param10: 1
				Param11: 2
				Param12: 1
				Param13: 34
			}
			ЦветТекста: 128
			Слой: Основной
		}
	}
}
