Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 119
			Высота: 51
			Заголовок: " "
			Флаги: FormFlag24
			Param24: 6
			Param25: 25
			Флаги2: FormFlag24
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Элементы: 
	{
		STATIC: 
		{
			Заголовок: "Не интерактивная"
			ДопФлаги: Flag0, Flag9, Flag28, Flag30
			X: 24
			Y: 24
			Ширина: 70
			Высота: 16
			ПорядокОбхода: 4152
			ОснФлаги: ШрифтПоУмолчанию, ЦветТекстаАвто
			Слой: Основной
		}
	}
}
