Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 320
			Высота: 165
			Заголовок: " "
			Param24: 6
			Param25: 32
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Элементы: 
	{
		BUTTON: КнопкаПерезагрузить
		{
			Заголовок: "Перезагрузить"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 130
			Y: 142
			Ширина: 63
			Высота: 14
			ПорядокОбхода: 4152
			Формула: "ОткрытьФорму(""Отчет""+Симв(35),, РасположениеФайла()); Форма.Закрыть(0);"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Закрыть"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 70
			Y: 142
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4153
			Формула: "#Закрыть"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "С&формировать"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, КнопкаПоУмолчанию, Flag28, Flag30
			X: 10
			Y: 142
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4154
			Формула: "Сформировать()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Запустить таймер 2"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 220
			Y: 117
			Ширина: 89
			Высота: 14
			ПорядокОбхода: 4155
			Формула: "ЗапуститьТаймер2()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Изменить интервал таймера"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 102
			Y: 117
			Ширина: 108
			Высота: 14
			ПорядокОбхода: 4156
			Формула: "ИзменитьИнтервалТаймера()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Запустить таймер"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 7
			Y: 117
			Ширина: 89
			Высота: 14
			ПорядокОбхода: 4157
			Формула: "ЗапуститьТаймер()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Проверить ГЛОБ таймер"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 207
			Y: 95
			Ширина: 89
			Высота: 14
			ПорядокОбхода: 4158
			Формула: "ПроверитьГлобальныйТаймер()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Запустить ГЛОБ таймер2"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 102
			Y: 95
			Ширина: 95
			Высота: 14
			ПорядокОбхода: 4159
			Формула: "ЗапуститьГлобальныйТаймер2()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Запустить ГЛОБ таймер"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 7
			Y: 95
			Ширина: 89
			Высота: 14
			ПорядокОбхода: 4160
			Формула: "ЗапуститьГлобальныйТаймер()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Запустить глоб. метод локального таймера "
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 10
			Y: 76
			Ширина: 171
			Высота: 14
			ПорядокОбхода: 4161
			Формула: "глРасширениеФормы_ОбработкаОжидания(Контекст)"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Проверить_FormEx_ИконкаПредупреждения"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 140
			Y: 57
			Ширина: 165
			Высота: 14
			ПорядокОбхода: 4162
			Формула: "Проверить_FormEx_ИконкаПредупреждения()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "ТестВызовШтатногоСобытия1С"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 7
			Y: 57
			Ширина: 119
			Высота: 14
			ПорядокОбхода: 4163
			Формула: "ТестВызовШтатногоСобытия1С()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "ПоказатьКартинку"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 198
			Y: 32
			Ширина: 89
			Высота: 14
			ПорядокОбхода: 4164
			Формула: "ПоказатьКартинку()"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "ЗакрытьВсеОкна"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 91
			Y: 30
			Ширина: 89
			Высота: 14
			ПорядокОбхода: 4165
			Формула: "ЗакрытьВсеОкна()"
			Слой: Основной
		}
	}
}
