Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 320
			Высота: 246
			Заголовок: "ТестоваяОбработка"
			АвтоПорядокОбхода: Нет
			Param24: 6
			Param25: 32
			Слои
			{
				Основной: Видимый, Активный
				Слой1: 
			}
		}
	}
	Элементы: 
	{
		BUTTON: кнЗакрыть
		{
			Заголовок: "Закрыть"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 70
			Y: 220
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4152
			Формула: "#Закрыть"
			Слой: Основной
		}
		BUTTON: кнВыполнить
		{
			Заголовок: "Выполнить"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, КнопкаПоУмолчанию, Flag28, Flag30
			X: 10
			Y: 220
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4153
			Формула: "Выполнить()"
			Слой: Основной
		}
		CHECKBOX: Флаг
		{
			Заголовок: "Флаг"
			Тип: Число
			Длина: 1
			ДопФлаги: Flag0, Flag1, Flag28, Flag30
			X: 16
			Y: 25
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4154
			Формула: "Флаг()"
			Слой: Основной
		}
		RADIO: 
		{
			Заголовок: "Переключатель2"
			ИдентификаторМетаданных: -1
			Тип: Число
			Длина: 3
			ДопФлаги: Flag0, КартинкаПоЦентру, ПервыйВГруппе, Flag28, Flag30
			X: 145
			Y: 24
			Ширина: 91
			Высота: 13
			ПорядокОбхода: 4155
			Слой: Основной
		}
		RADIO: Переключатель
		{
			Заголовок: "Переключатель"
			Тип: Число
			Длина: 3
			ДопФлаги: Flag0, КартинкаПоЦентру, ПервыйВГруппе, Flag28, Flag30
			X: 70
			Y: 25
			Ширина: 91
			Высота: 13
			ПорядокОбхода: 4156
			Формула: "Переключатель()"
			Слой: Основной
		}
		LISTBOX: Список
		{
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 18
			Y: 53
			Ширина: 66
			Высота: 53
			ПорядокОбхода: 4157
			Формула: "Список()"
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		LISTBOX: СписокСПометками
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 105
			Y: 53
			Ширина: 66
			Высота: 53
			ПорядокОбхода: 4158
			Формула: "СписокСПометками()"
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		COMBOBOX: ПолеСоСписком
		{
			ДопФлаги: Flag0, Flag1, РастянутьКартинку, Flag21, Flag23, Flag28, Flag30
			X: 187
			Y: 53
			Ширина: 78
			Высота: 13
			ПорядокОбхода: 4159
			Формула: "ПолеСоСписком()"
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		1CGROUPBOX: Рамка
		{
			Заголовок: "Рамка"
			ДопФлаги: Flag0, Flag1, Flag2, Flag28, Flag30
			X: 8
			Y: 40
			Ширина: 279
			Высота: 77
			ПорядокОбхода: 4160
			Слой: Основной
		}
		STATIC: статикТекст
		{
			Заголовок: "статикТекст"
			ДопФлаги: Flag28, Flag30
			X: 192
			Y: 78
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4161
			Формула: "статикТекст()"
			ОснФлаги: ШрифтПоУмолчанию, ЦветТекстаАвто
			Слой: Основной
		}
		TABLE: ТаблицаЗначенийСПометками
		{
			ДопФлаги: Flag21, Flag23, Flag28, Flag30
			X: 222
			Y: 126
			Ширина: 71
			Высота: 64
			ПорядокОбхода: 4162
			Формула: "ТаблицаЗначенийСПометками()"
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		PICTURE: Картинка
		{
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag15, Flag28, Flag30
			X: 19
			Y: 142
			Ширина: 34
			Высота: 18
			ПорядокОбхода: 4163
			ОснФлаги: РастянутьКартинку, ВыпуклаяРамка
			Пиктограмма: 0x10000004
			Слой: Основной
		}
		TABLE: ТаблицаЗначений
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag21, Flag23, Flag28, Flag30
			X: 117
			Y: 126
			Ширина: 86
			Высота: 60
			ПорядокОбхода: 4164
			Формула: "ТаблицаЗначений()"
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		BUTTON: КнопкаЛевоВерх
		{
			Заголовок: "Кнопка"
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 4
			Y: 21
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4165
			ОснФлаги: РастянутьКартинку
			Слой: Основной
		}
		COMBOBOX: ПолеСоСписком123
		{
			ДопФлаги: Flag0, Flag1, РастянутьКартинку, Flag21, Flag23, Flag28, Flag30
			X: 58
			Y: 37
			Ширина: 132
			Высота: 103
			ПорядокОбхода: 4166
			ОснФлаги: НеСохранять
			Слой: Слой1
		}
		BMASKED: РеквизитСправочника
		{
			ИдентификаторМетаданных: -1
			Тип: Справочник
			Агрегатный тип: Справочник.Новый1
			ДопФлаги: Flag23, Flag28, Flag30
			X: 18
			Y: 165
			Ширина: 82
			Высота: 13
			ПорядокОбхода: 4167
			Формула: "РеквизитСправочника()"
			ОснФлаги: Педалька
			Слой: Основной
		}
		BMASKED: РеквизитНеопределенный
		{
			ИдентификаторМетаданных: -1
			Тип: Справочник
			Агрегатный тип: Справочник.Новый1
			ДопФлаги: Flag23, Flag28, Flag30
			X: 18
			Y: 183
			Ширина: 82
			Высота: 13
			ПорядокОбхода: 4168
			Формула: "РеквизитНеопределенный()"
			ОснФлаги: Педалька
			Слой: Основной
		}
		BMASKED: Реквизит
		{
			ИдентификаторМетаданных: -1
			Тип: Строка
			Длина: 10
			ДопФлаги: Flag23, Flag28, Flag30
			X: 21
			Y: 120
			Ширина: 82
			Высота: 13
			ПорядокОбхода: 4169
			Формула: "Реквизит()"
			ОснФлаги: Педалька
			Слой: Основной
		}
	}
}
