Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 204
			Высота: 115
			Заголовок: " "
			Param24: 6
			Param25: 25
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Элементы: 
	{
		BUTTON: 
		{
			Заголовок: "Закрыть"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 137
			Y: 92
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4152
			Формула: "#Закрыть"
			Слой: Основной
		}
		1CEDIT: ЧисловоеПоле2
		{
			ИдентификаторМетаданных: -1
			Тип: Число
			Длина: 10
			ДопФлаги: Flag23, Flag28, Flag30
			X: 17
			Y: 62
			Ширина: 80
			Высота: 13
			ПорядокОбхода: 4153
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		BUTTON: кнПлюс2
		{
			Заголовок: "+2"
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 112
			Y: 42
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4154
			Формула: "ЧисловоеПоле2=ЧисловоеПоле1+2"
			Слой: Основной
		}
		1CEDIT: ЧисловоеПоле1
		{
			ИдентификаторМетаданных: -1
			Тип: Число
			Длина: 10
			ДопФлаги: Flag23, Flag28, Flag30
			X: 17
			Y: 42
			Ширина: 80
			Высота: 13
			ПорядокОбхода: 4155
			Формула: "ЧисловоеПоле2=ЧисловоеПоле1+1"
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		1CEDIT: ПеременнаяФормы
		{
			ИдентификаторМетаданных: -1
			Тип: Строка
			ДопФлаги: Flag23, Flag28, Flag30
			X: 17
			Y: 22
			Ширина: 80
			Высота: 13
			ПорядокОбхода: 4156
			Слой: Основной
		}
	}
}
