Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 320
			Высота: 165
			Заголовок: " "
			АвтоПорядокОбхода: Нет
			Param24: 6
			Param25: 32
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Элементы: 
	{
		STATIC: статикТекст
		{
			Заголовок: "Текст"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag28, Flag30
			X: 197
			Y: 83
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4152
			Формула: "Текст()"
			ОснФлаги: ШрифтПоУмолчанию, ЦветТекстаАвто
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "Кнопка"
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 53
			Y: 116
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4153
			Слой: Основной
		}
	}
}
