{"Shell",
{"Folder","AST","1С++ классы таймера","",
{"Folder","AST","Общие.Таймер","",
{"Folder","AST","Методы","",
{"Item","AST","Запуск","","Запуск(<?>)","(<?>)","@Синтаксис:
Запуск(<Режим>)
@Назначение:
Запустить в очередной раз подсчет для действия Режим.
@Параметры:
<Режим> - (Строка)  Необязательный параметр."},
{"Item","AST","Стоп","","Стоп(<?>)","(<?>)","@Синтаксис:
Стоп(<Режим>)
@Назначение:
Остановить подсчет для действия Режим.
@Параметры:
<Режим> - (Строка)  Необязательный параметр."},
{"Item","AST","Очистить","","Очистить(<?>)","(<?>)","@Синтаксис:
Очистить(<Режим>)
@Назначение:
Обнулить время выполнения для действия Режим, если указан.
@Параметры:
<Режим> - (Строка)  Необязательный параметр. 
@Замечание:
Если Режим="""", обнуляет все."},
{"Item","AST","СортироватьПоВремени","","СортироватьПоВремени(<?>)","(<?>)","@Синтаксис:
СортироватьПоВремени()
@Назначение:
Сортировать внутреннюю таблицу в порядке возрастания/убывания времени выполнения."},
{"Item","AST","Получить","","Получить(<?>)","(<?>)","@Синтаксис:
Получить(<Режим>)
@Назначение:
Получить время выполнения действия Режим в виде числа.
@Возвращаемое значение:
(Число)  Время выполнения переданного действия.
@Параметры:
<Режим> - (Строка)  Необязательный параметр."},
{"Item","AST","ПолучитьКакСтроку","","ПолучитьКакСтроку(<?>)","(<?>)","@Синтаксис:
ПолучитьКакСтроку()
@Назначение:
Получить время выполнения действия Режим в виде строки
@Возвращаемое значение:
(Строка)  Время выполнения переданного действия."},
{"Item","AST","ПолучитьВсеКакСтроку","","ПолучитьВсеКакСтроку(<?>)","(<?>)","@Синтаксис:
ПолучитьВсеКакСтроку()
@Назначение:
Получить время выполнения всех действий в виде строки.
@Возвращаемое значение:
(Строка)  Время выполнения всех действий."}},
{"Item","AST","Автор","","Автор","","Имя класса: Артур.Таймер
Дата изменения: 28.06.03

Автор: Артур Аюханов aka artbear.
E-mail: @artbear@bashnet.ru"},
{"Item","AST","Описание","","Описание","","@Синтаксис:
Описание
@Назначение:
Подсчет общего времени выполнения. Выполняется даже для функций, чей код выполняется не один раз. Может использоваться для замера производительности классов 1С.
@Замечание:
Если определена директива _LOAD_TIMER, методы класса работают. Если не определена, то методы ничего не делают.
@Пример:
Таймер = СоздатьОбъект(""Общие.Таймер"");
Таймер.Запуск(""Общее время"");
Операция1();
Таймер.Запуск(""Операция2"");
Операция2();
Таймер.Стоп(""Операция2"");
Таймер.Стоп(""Общее время"");
Сообщить(""ВремяВыполнения - ""+Таймер.ПолучитьВсеКакСтроку());"}},
{"Folder","AST","Общие.ТаймерСКоличеством","",
{"Folder","AST","Методы","",
{"Item","AST","Запуск","","Запуск(<?>)","(<?>)","@Синтаксис:
Запуск(<Режим>)
@Назначение:
Запустить в очередной раз подсчет для действия Режим.
@Параметры:
<Режим> - (Строка)  Необязательный параметр."},
{"Item","AST","Стоп","","Стоп(<?>)","(<?>)","@Синтаксис:
Стоп()
@Назначение:
Остановить подсчет для действия Режим."},
{"Item","AST","Очистить","","Очистить(<?>)","(<?>)","@Синтаксис:
Очистить()
@Назначение:
Обнулить время выполнения для действия Режим, если указан.
@Замечание:
Если Режим="""", обнуляет все."},
{"Item","AST","СортироватьПоКоличеству","","СортироватьПоКоличеству(<?>)","(<?>)","@Синтаксис:
СортироватьПоКоличеству()
@Назначение:
Сортировать внутреннюю таблицу в порядке возрастания/убывания количества запусков на выполнение."},
{"Item","AST","ПолучитьКоличество","","ПолучитьКоличество(<?>)","(<?>)","@Синтаксис:
ПолучитьКоличество()
@Назначение:
Получить количество запусков действия Режим в виде числа."},
{"Item","AST","ПолучитьКоличествоКакСтроку","","ПолучитьКоличествоКакСтроку(<?>)","(<?>)","@Синтаксис:
ПолучитьКоличествоКакСтроку()
@Назначение:
Получить количество запусков выполнения действия Режим в виде строки."},
{"Item","AST","ПолучитьВсеКоличествоКакСтроку","","ПолучитьВсеКоличествоКакСтроку(<?>)","(<?>)","@Синтаксис:
ПолучитьВсеКоличествоКакСтроку()
@Назначение:
Получить количество запусков всех действий."},
{"Item","AST","ПолучитьВсеКакТаблицу","","ПолучитьВсеКакТаблицу(<?>)","(<?>)","@Синтаксис:
ПолучитьВсеКакТаблицу()
@Назначение:
Получить результаты как таблицу значений с колонками ""Режим"", ""Время"", ""Количество""."},
{"Item","AST","ПолучитьВсеКакСтроку","","ПолучитьВсеКакСтроку(<?>)","(<?>)","@Синтаксис:
ПолучитьВсеКакСтроку()
@Назначение:
Получить время + количество выполнения всех действий в виде строки."}},
{"Item","AST","Автор","","Автор(<?>)","(<?>)","Имя класса: Артур.ТаймерСКоличеством.
Дата изменения: 25.09.03

Автор: Артур Аюханов aka artbear.
E-mail: @artbear@bashnet.ru"},
{"Item","AST","Описание","","Описание","","@Синтаксис:
Описание
@Назначение:
Подсчет общего времени выполнения и количества запусков. Выполняется даже для функций, чей код выполняется не один раз. Может использоваться для замера производительности классов 1С.
@Замечание:
Если определена директива _LOAD_TIMER, методы класса работают. Если не определена, то методы ничего не делают.  Наследник класса Общие.Таймер."}},
{"Item","AST","Автор","","Автор(<?>)","(<?>)","Артур Аюханов aka artbear (с) 2003

E-mail: @artbear@bashnet.ru"}}}