Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 70
			Высота: 46
			Заголовок: " "
			Param24: 6
			Param25: 32
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Элементы: 
	{
		STATIC: 
		{
			Заголовок: "defcls"
			ДопФлаги: Flag28, Flag30
			X: 9
			Y: 24
			Ширина: 54
			Высота: 13
			ПорядокОбхода: 4152
			ОснФлаги: ЦветТекстаАвто
			Шрифт: MS Sans Serif
			{
				Размер: 10
				Жирный: Да
				Param9: 204
				Param10: 1
				Param11: 2
				Param12: 1
				Param13: 34
			}
			Слой: Основной
		}
	}
}
