Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 273
			Высота: 141
			Заголовок: " "
			Param24: 6
			Param25: 25
			Слои
			{
				Основной: Видимый, Активный
			}
		}
	}
	Элементы: 
	{
		BUTTON: 
		{
			Заголовок: "Закрыть"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 207
			Y: 117
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4152
			Формула: "#Закрыть"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "С&формировать"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, КнопкаПоУмолчанию, Flag28, Flag30
			X: 137
			Y: 117
			Ширина: 54
			Высота: 14
			ПорядокОбхода: 4153
			Формула: "Сформировать()"
			Слой: Основной
		}
		TABLE: тзНаФорме
		{
			ДопФлаги: Flag21, Flag23, Flag28, Flag30
			X: 147
			Y: 42
			Ширина: 115
			Высота: 65
			ПорядокОбхода: 4154
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		LISTBOX: ПолеСоСписком
		{
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 12
			Y: 42
			Ширина: 114
			Высота: 65
			ПорядокОбхода: 4155
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		1CEDIT: ПолеВвода
		{
			ИдентификаторМетаданных: -1
			Тип: Строка
			ДопФлаги: Flag23, Flag28, Flag30
			X: 202
			Y: 22
			Ширина: 58
			Высота: 13
			ПорядокОбхода: 4156
			ОснФлаги: НеСохранять
			Слой: Основной
		}
		BMASKED: Реквизит
		{
			ИдентификаторМетаданных: -1
			Тип: Справочник
			Агрегатный тип: Справочник.Новый1
			ДопФлаги: Flag23, Flag28, Flag30
			X: 62
			Y: 22
			Ширина: 107
			Высота: 13
			ПорядокОбхода: 4157
			ОснФлаги: Педалька
			Слой: Основной
		}
		CHECKBOX: Флажок
		{
			Заголовок: "Флажок"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, Flag28, Flag30
			X: 12
			Y: 22
			Ширина: 39
			Высота: 13
			ПорядокОбхода: 4158
			Слой: Основной
		}
	}
}
